app/controllers/songs_controller.rb

  def edit
    @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @song = Song.new()
    @song.content = params[:content]
    @song.title = params[:title]
    @song.user_id = current_user.id

    logger.debug '@song:'
    logger.debug @song

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "cymbals and more cymbals"], ["created_at", Mon, 18 Feb 2013 14:51:21 UTC +00:00], ["title", "electricky noisy garbage"], ["updated_at", Mon, 18 Feb 2013 14:51:21 UTC +00:00]]

  def update
    @song = Song.find(params[:id])

    respond_to do |format|
      if @song.update_attributes(params[:song])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "songs" SET "content" = 'chris', "created_at" = '2013-02-18 14:51:21.000000', "updated_at" = '2013-02-18 14:51:21.000000' WHERE "songs"."id" = 1

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]